# SQLite

*Adapted from https://sql.js.org/examples/GUI/index.html*

**Important!** Before we get too far into this, you should know that there is currently no ability to:

- save the database to browser storage;
- export the database;
- load a database from browser storage;
- load a database from a URL;
- load a database from the desktop;
- connect to a remote sqlite database file.

*Caveat Emptor.*

Let's get started by creating a new database.

In [12]:
%CREATE example_db.db

 *no way to export this database from Jupyterlite.* You're welcome to do whatever you like, but DO NOT use this as a database manager expecting to be able to leverage the database outside of this application.

In [14]:
CREATE TABLE employees( id          integer,  name    text,
                          designation text,     manager integer,
                          hired_on    date,     salary  integer,
                          commission  float,    dept    integer);

One other critical constraint to be aware of is that only the first SQL query in a cell is evaluated. So, for example, it we run:

In [15]:
INSERT INTO employees VALUES (1,'JOHNSON','ADMIN',6,'1990-12-17',18000,NULL,4);
INSERT INTO employees VALUES (2,'HARDING','MANAGER',9,'1998-02-02',52000,300,3);

It SEEMS to work just fine. But if we then query the contents of the table...

In [16]:
SELECT * FROM employees;

+----+---------+-------------+---------+------------+--------+------------+------+
| id | name    | designation | manager | hired_on   | salary | commission | dept |
+----+---------+-------------+---------+------------+--------+------------+------+
| 1  | JOHNSON | ADMIN       | 6       | 1990-12-17 | 18000  |            | 4    |
+----+---------+-------------+---------+------------+--------+------------+------+

That having been said, SQL queries run perfectly well once your data is (painfully) ennumerated.

In [10]:
SELECT designation,COUNT(*) AS nbr, (AVG(salary)) AS avg_salary FROM employees GROUP BY designation ORDER BY avg_salary DESC;

+-------------+-----+------------+
| designation | nbr | avg_salary |
+-------------+-----+------------+
| ADMIN       | 1   | 18000.0    |
+-------------+-----+------------+